$(document).ready(function () {
  if (localStorage.getItem("localization") === "AR") {
    $(".container").empty();
    $(".container").append("<h3>نصائح أمنية</h3>");
    $(".container").append(
      "<p>يلتزم بنك أبو ظبي التجاري مصر بضمان أن تظل حساباتك آمنة وأن تظل معلوماتك الشخصية خاصة. تحقيقًا لهذه الغاية ، إليك بعض النصائح التي ستساعدك على الشعور بالراحة عندما تتعامل معنا.</p>"
    );
    $(".container").append("<h4>كمبيوتر شخصي</h4>");

    $(".container").append(` <ul>
    <li class="lead lead-normal">
    قم بتثبيت جميع تحديثات الأمان التي يقدمها مزود (مزودو البرامج) لديك.
    </li>
    <li class="lead lead-normal">
    تثبيت جدار حماية شخصي على جهاز الكمبيوتر الخاص بك.
    </li>
    <li class="lead lead-normal">
    قم بحماية جهاز الكمبيوتر الخاص بك ضد الفيروسات وبرامج التجسس باستخدام برنامج مكافحة برامج التجسس وبرامج مكافحة الفيروسات والترقيات التلقائية.
    </li>
    <li class="lead lead-normal">
    فحص جهاز الكمبيوتر الخاص بك بانتظام لكل من برامج التجسس والفيروسات.
    </li>
    <li class="lead lead-normal">
    تجنب تحميل البرامج من مصادر غير معروفة. قد تحتوي بعض المصادر على أشكال مخفية من برامج التجسس أو الفيروسات التي قد تعرض أمان الكمبيوتر لديك للخطر.
    </li>
    <li class="lead lead-normal">
    يمكنك التحقق من المواقع الآمنة عن طريق "النقر المزدوج" على أيقونة القفل الموجودة في أسفل تطبيق المتصفح وقراءة معلومات الموقع في المربع الذي يظهر.
    </li>
    <li class="lead lead-normal">تنشيط مانع النوافذ المنبثقة.
    </li>
    <li class="lead lead-normal">
    ترك المواقع المشبوهة. إذا لم يبدو أن الموقع هو ما كنت تتوقعه ، فاتركه على الفور.
    </li>
    <li class="lead lead-normal">
    عندما لا يكون جهاز الكمبيوتر الخاص بك غير مستخدم ، قم بإغلاقه أو فصله عن الإنترنت.
    </li>
    <li class="lead lead-normal">
    كن حذرا في أنشطتك عبر الإنترنت. ضع في اعتبارك دائمًا أن تزوير رسائل البريد الإلكتروني وإنشاء مواقع ويب احتيالية ليس بالأمر الصعب.
    </li>
    <li class="lead lead-normal">
    تأكيد صحة جميع طلبات الحصول على معلومات شخصية أو مالية أو معلومات حساسة مع البنك ، خاصة إذا تم تقديمها بطريقة عاجلة أو تهديديه.
    </li>
    <li class="lead lead-normal">
    اقرأ وتعرف على سياسات الخصوصية والإفصاحات القانونية لموفري البرامج.
    </li>
  </ul>
`);

    $(".container").append("<h4>البريد الإلكتروني</h4>");

    $(".container").append(`        <ul>
    <li class="lead lead-normal">
    سؤال الرسائل البريد الإلكتروني المشبوهة. لن يقوم بنك أبو ظبي التجاري مصر أبداً بإرسال بريد إليكتروني يطلب فيه اسم المستخدم أو كلمة المرور الخاصة بك على الإنترنت.
    </li>
    <li class="lead lead-normal">
    إذا تلقيت بريدًا إلكترونيًا يبدو أنه مريب ، فلا ترد عليه أو انقر فوق الرابط الذي يوفره. ببساطة احذفه.
    </li>
    <li class="lead lead-normal">
    إذا كنت تعتقد أنك قد قدمت معلومات شخصية أو معلومات حسابية استجابةً لرسالة بريد إلكتروني أو موقع مخادعين ، فأبلغ عن الاحتيال على الفور بالاتصال 16862 ، وقم بتغيير كلمة مرورك ، ورصد نشاط حسابك بشكل متكرر.
    </li>
    <li class="lead lead-normal">
    تجنب النقر على الروابط المتوفرة في رسائل البريد الإلكتروني. من الأفضل دائمًا كتابة العنوان في متصفحك.
    </li>
    <li class="lead lead-normal">
    فتح مرفقات البريد الإلكتروني فقط إذا كنت تعرف المرسل. من الأفضل مسح المرفقات باستخدام برنامج مكافحة الفيروسات قبل الفتح.
    </li>
    <li class="lead lead-normal">
    لا تفتح مرفقات البريد الإلكتروني التي تحتوي على نهايات ملفات .exe أو .pif أو .vbs. هذه امتدادات للملفات التنفيذية ، وهي عادة ملفات خطيرة.
    </li>
    <li class="lead lead-normal">
    كن حذرا وانتقائي قبل تقديم عنوان بريدك الإلكتروني إلى موقع مشكوك فيه. إن مشاركة عنوان بريدك الإلكتروني تجعلك أكثر عرضة لتلقي رسائل البريد الإلكتروني الاحتيالية.
    </li>
  </ul>
`);

    $(".container").append(`<h4>الخدمات المصرفية عبر الإنترنت</h4>`);
    $(".container").append(`  <ul>
    <li class="lead lead-normal">
    مراقبة نشاطك في كثير من الأحيان للكشف عن الاحتيال في وقت سابق.
    </li>
    <li class="lead lead-normal">
    استعرض بيانات بطاقتك الائتمانية الشهرية والحسابات المصرفية بدقة. التحقيق في العناصر المشبوهة على الفور.
    </li>
    <li class="lead lead-normal">
    تجنب استخدام مقاهي الإنترنت / أجهزة الكمبيوتر العامة، استخدم الجهاز المنزلي أو جهاز اخر تعرف انه يتبع طرق حماية جيدة.
    </li>
    <li class="lead lead-normal">
    تسجيل الخروج دائما من صفحة الخدمات المصرفية عبر الإنترنت.
    </li>
  </ul>`);
    $(".container").append("<h4>كلمة المرور و الرقم التعريفي</h4>");
    $(".container").append(` <ul>
    <li class="lead lead-normal">
    اختر كلمة المرور وأرقام التعريف الشخصية (و الارقام التعريفية) التي يصعب على الآخرين تخمينها.
    </li>
    <li class="lead lead-normal">
    استخدام كلمة مرور مختلفة لكل حساب من حساباتك على الإنترنت.
    </li>
    <li class="lead lead-normal">
    لا تشارك هويتك أو كلمات مرورك أو أرقام التعريف الشخصية.
    </li>
    <li class="lead lead-normal">
    تغيير كلمات المرور الخاصة بك.
    </li>
    <li class="lead lead-normal">
    لا تحاول استخدام المعلومات الشخصية في كلمات المرور الخاصة بك أو أرقام التعريف الشخصية. - كلمات المرور التي تحتوي على معلومات عن اسمك أو تاريخ ميلادك أو رقم هاتفك.
    </li>
  </ul>
    `);

    $(".container").append(`<h4>بطاقة الائتمان/ بطاقة الخصم</h4>`);

    $(".container").append(`   <ul>
    <li class="lead lead-normal">
    لا تحمل رقم التعريف الشخصي الخاص بك ببطاقة الائتمان / الخصم (الرقم التعريفي) معك. حفظه ، أو الحفاظ على الرقم في مكان آمن في المنزل.
    </li>
    <li class="lead lead-normal">
    اصنع نسخًا من جميع معلومات البطاقة التي تحملها يوميًا واحتفظ بها في مكان آمن.
    </li>
    <li class="lead lead-normal">
    استعرض بيانات بطاقتك الائتمانية الشهرية والحسابات المصرفية بدقة. التحقيق في العناصر المشبوهة على الفور والإبلاغ عن أي احتيال محتمل قبل حدوثه.
    </li>
    <li class="lead lead-normal">
    الإبلاغ عن البطاقات المفقودة أو المسروقة على الفور ، اتصل على 16862.
    </li>
    <li class="lead lead-normal">
    تأكد دائمًا من استرداد بطاقتك وإيصالها بعد كل معاملة.
    </li>
    <li class="lead lead-normal">
    احم بطاقتك من التلف وتجنب تركها بالقرب من الأجهزة المغناطيسية أو الهواتف المحمولة.
    </li>
  </ul>`);
    $(".container").append(`<h4>ماكينة الصراف الآلي</h4>`);

    $(".container").append(`<ul>
    <li class="lead lead-normal">
    قم بتغطية لوحة مفاتيح أجهزة الصراف الآلي أثناء إدخال أرقام التعريفي الخاص بك.
    </li>
    <li class="lead lead-normal">كن حذرا من الغرباء القريبين.</li>
    <li class="lead lead-normal">
    إذا لاحظت أي شيء مشبوه أو غير آمن ، فقم بإلغاء المعاملة  و الابلاغ على الفور ، اتصل بالرقم 16862.
    </li>
    <li class="lead lead-normal">
    الإخطار عن فقدان أو سرقة بطاقات الصراف الآلي على الفور ، اتصل على 16862.
    </li>
    <li class="lead lead-normal">
    لا تترك ايصال المعاملة خلفك اطلاقا.
    </li>
  </ul>`);
  }
});
